app/controllers/events_controller.rb

    def set_starred_state(intended_starred_state)
      @event = Event.find(params[:id])
---
SELECT * FROM `events` WHERE (`events`.`id` IN (1,2))